let answer;
let res = 0;

let questions = new Array();
questions[0] = "Какая планета самая большая в Солнечной системе? \nA) Земля \nB) Марс \nC) Юпитер*  \nD) Сатурн";
questions[1] = "Кто написал роман «Война и мир»? \nA) Ф.М. Достоевский \nB) Л.Н. Толстой * \nC) А.С. Пушкин \nD) И.С. Тургенев";
questions[2] = "Столицей какого государства является Канберра? \nA) Канада \nB) Австралия * \nC) Австрия \nD) Новая Зеландия";
questions[3] = "В каком году произошло крещение Руси? \nA) 862 г. \nB) 988 г. * \nC) 1147 г. \nD) 1240 г.";
questions[4] = "Как называется самая длинная река в мире? \nA) Амазонка * \nB) Нил \nC) Миссисипи \nD) Янцзы";
questions[5] = "Кто написал картину «Мона Лиза»?  \nA) Леонардо да Винчи * \nB) Рафаэль Санти \nC) Микеланджело \nD) Сандро Боттичелли";
questions[6] = "Какое вещество является самым твердым на Земле? \nA) Гранит \nB) Железо \nC) Алмаз * \nD) Кварц";
questions[7] = "В какой стране зародились Олимпийские игры? \nA) Рим \nB) Греция * \nC) Египет \nD) Китай";
questions[8] = "Кто был первым человеком, полетевшим в космос? \nA) Нил Армстронг \nB) Юрий Гагарин * \nC) Сергей Королев \nD) Алексей Леонов";
questions[9] = "Сколько штатов в США? \nA) 48 \nB) 50 * \nC) 51 \nD) 52";
questions[10] = "Какой элемент таблицы Менделеева обозначается буквой «Fe»? \nA) Фтор \nB) Фермий \nC) Железо * \nD) Фосфор";
questions[11] = "Что изучает наука ботаника? \nA) Животных \nB) Растения * \nC) Звезды \nD) Минералы";
questions[12] = "Кто написал оперу «Евгений Онегин»? \nA) М.И. Глинка \nB) Н.А. Римский-Корсаков \nC) П.И. Чайковский * \nD) С.В. Рахманинов";
questions[13] = "Какое море самое соленое в мире? \nA) Красное море * \nB) Черное море \nC) Средиземное море \nD) Каспийское море";
questions[14] = "Сколько дней в високосном году? \nA) 365 \nB) 366 * \nC) 364 \nD) 360";

let answers = new Array();
let answers1 = new Array();

answers[0] = "c";
answers[1] = "b";
answers[2] = "b";
answers[3] = "b";
answers[4] = "a";
answers[5] = "a"; //
answers[6] = "c";
answers[7] = "b";
answers[8] = "b";
answers[9] = "b";
answers[10] = "c"; //
answers[11] = "b";
answers[12] = "c";
answers[13] = "a";
answers[14] = "b";

answers1[0] = "C";
answers1[1] = "B";
answers1[2] = "B";
answers1[3] = "B";
answers1[4] = "A";
answers1[5] = "A"; //
answers1[6] = "C";
answers1[7] = "B";
answers1[8] = "B";
answers1[9] = "B";
answers1[10] = "C"; //
answers1[11] = "B";
answers1[12] = "C";
answers1[13] = "A";
answers1[14] = "B";

let money = new Array();
money[0] = `500`;
money[1] = `1000`;
money[2] = `2000`;
money[3] = `3000`;
money[4] = `5000`; //
money[5] = `10000`;
money[6] = `15000`;
money[7] = `25000`;
money[8] = `50000`;
money[9] = `100000`; //
money[10] = `200000`;
money[11] = `400000`;
money[12] = `600000`;
money[13] = `800000`;
money[14] = `1000000`;

alert("Добро пожаловать в игру: «Первый Миллион»!");

for (let i = 0; i < questions.length; i++) {
    alert("Вопрос " + (i + 1) + ":");
    answer = prompt(questions[i]);
    if (answer == answers[i] || answer == answers1[i]) {
        alert("Вы заработали " + money[i]);
        if (i == 4 || i == 9){
            alert("Вы добрались до несгораемой суммы!");
            res = money[i];
        }
    } else {
        alert("Конец Игры!");
        alert("Вы выиграли: " + res);
        break;
    }

    if(money[i] == 1000000) {
        alert("Поздравляю! Вы выиграли!");
    }
}